/*�*REXX program  calculates and displays  some values for the  Ackermann function.       */
/*�*╔════════════════════════════════════════════════════════════════════════╗
║  Note:  the Ackermann function  (as implemented here)  utilizes deep   ║
║         recursive and is limited by the largest number that can have   ║
║         "1"  (unity) added to a number  (successfully and accurately). ║
╚════════════════════════════════════════════════════════════════════════╝*/
high=24
do     j=0  to 3;                    say
do k=0  to high % (max(1, j))
call tell_Ack  j, k
end   /*�*k*/
end       /*�*j*/
exit                                             /*�*stick a fork in it,  we're all done. */
/*�*──────────────────────────────────────────────────────────────────────────────────────*/
tell_Ack:  parse arg mm,nn;   calls=0            /*�*display an echo message to terminal. */
newV1=right(nn,length(high))
say 'Ackermann('mm", "newV1')='right(ackermann(mm, nn), high),
left('', 12)     'calls='right(calls, high)
return
/*�*──────────────────────────────────────────────────────────────────────────────────────*/
ackermann: procedure expose calls                /*�*compute value of Ackermann function. */
parse arg m,n;   calls=calls+1
if m==0  then return n+1
if n==0  then return ackermann(m-1, 1)
return ackermann(m-1, ackermann(m, n-1) )
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Ackermann-function\ackermann-function-1.rexx was migrated on 23 Mar 2025 at 10:43:04
 * -------------------------------------------------------------------------
*/ 
