msgText = 'Goodbye, World!'
call charout 'STDERR', msgText
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Hello-world-Standard-error\hello-world-standard-error-2.rexx was migrated on 23 Mar 2025 at 10:43:16
 * -------------------------------------------------------------------------
*/ 
