Parse Version v
Say v
Call sub
Say 'Back from sub'
Exit
sub:
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Program-termination\program-termination-2.rexx was migrated on 23 Mar 2025 at 10:43:25
 * -------------------------------------------------------------------------
*/ 
