/*ª*REXX pgm displays a   "Goodbye, World!"   without a trailing newline. */

call charout ,'Goodbye, World!'
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Hello-world-Newline-omission\hello-world-newline-omission.rexx was migrated on 23 Mar 2025 at 10:43:16
 * -------------------------------------------------------------------------
*/ 
