do while stream(stdin, "State") <> "NOTREADY"
call charout ,charin(stdin)
end
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Input-loop\input-loop-1.rexx was migrated on 23 Mar 2025 at 10:43:17
 * -------------------------------------------------------------------------
*/ 
