/*ª*REXX program reads from the (console) default input stream until null*/
do  until newV1==''
parse pull newV1
end   /*ª*until*/                 /*ª*stick a fork in it, we're done.*/
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Input-loop\input-loop-4.rexx was migrated on 23 Mar 2025 at 10:43:17
 * -------------------------------------------------------------------------
*/ 
