/*ª* -- AREXX -- */
do until eof(stdin)
l = readln(stdin)
say l
end
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Input-loop\input-loop-3.rexx was migrated on 23 Mar 2025 at 10:43:17
 * -------------------------------------------------------------------------
*/ 
