/*ª*REXX program outputs its own multiâ”€line source.*/

do j=1  for sourceline()
say sourceline(j)
end   /*ª*j*/
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Quine\quine-2.rexx was migrated on 23 Mar 2025 at 10:43:25
 * -------------------------------------------------------------------------
*/ 
