/*ª*REXX program to greet the world enthusiastically. */
say "Hello world!"
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Hello-world-Newbie\hello-world-newbie.rexx was migrated on 23 Mar 2025 at 10:43:16
 * -------------------------------------------------------------------------
*/ 
