zz= 'llo world!'          /*�*─────────────── using literal abuttal.────────────*/
zz= 'he'zz                /*�*This won't work if the variable name is  X  or  B */
say zz


gg = "llo world!"         /*�*─────────────── using literal concatenation.──────*/
gg = 'he' || gg
say gg


aString= 'llo world!'     /*�*─────────────── using variable concatenation.─────*/
bString= "he"
aString= bString || aString
say aString
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\String-prepend\string-prepend.rexx was migrated on 23 Mar 2025 at 10:43:31
 * -------------------------------------------------------------------------
*/ 
