say 'enter an expression:'
parse pull x
interpret 'expression=' x
say 'expression=' expression
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Special-characters\special-characters-16.rexx was migrated on 23 Mar 2025 at 10:43:30
 * -------------------------------------------------------------------------
*/ 
