do thing=1  by  3/2  to 10
say  thing
end
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Loops-For-with-a-specified-step\loops-for-with-a-specified-step-2.rexx was migrated on 23 Mar 2025 at 10:43:19
 * -------------------------------------------------------------------------
*/ 
