Do v=1  by  3/2  While v**2<30
Say  v
End
Say '('v'**2) is greater than 30 (30.25)'
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Loops-For-with-a-specified-step\loops-for-with-a-specified-step-3.rexx was migrated on 23 Mar 2025 at 10:43:19
 * -------------------------------------------------------------------------
*/ 
