do x=1  to 10  by 1.5
say x
end
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Loops-For-with-a-specified-step\loops-for-with-a-specified-step-1.rexx was migrated on 23 Mar 2025 at 10:43:19
 * -------------------------------------------------------------------------
*/ 
