/*ª* ft=rexx */
/*ª* GET2.RX - Display contents of an URL on the terminal. */
/*ª* Usage: rexx get.rx http://rosettacode.org             */
parse arg url .
'curl' url
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\HTTP\http-1.rexx was migrated on 23 Mar 2025 at 10:43:16
 * -------------------------------------------------------------------------
*/ 
