/*ª*REXX program to show a line of text.  */
yyy = 'Hello world!'
say yyy
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Hello-world-Text\hello-world-text-2.rexx was migrated on 23 Mar 2025 at 10:43:16
 * -------------------------------------------------------------------------
*/ 
