/*ª*REXX program obtains two numbers from the input stream (the console), shows their sum.*/
parse pull a b                                   /*ª*obtain two numbers from input stream.*/
say (a+b) / 1                                    /*ª*display normalized sum to terminal.  */
/*ª*stick a fork in it,  we're all done. */
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\A+B\a+b-2.rexx was migrated on 23 Mar 2025 at 10:43:04
 * -------------------------------------------------------------------------
*/ 
