/*ª*REXX program obtains two numbers from the input stream (the console), shows their sum.*/
parse pull a b                                   /*ª*obtain two numbers from input stream.*/
say a+b                                          /*ª*display the sum to the terminal.     */
/*ª*stick a fork in it,  we're all done. */
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\A+B\a+b-1.rexx was migrated on 23 Mar 2025 at 10:43:04
 * -------------------------------------------------------------------------
*/ 
