/*ª*REXX program that demonstrates what happens when dividing by zero.  */
y=7
say 44 / (7-y)      /*ª* divide by some strange thingy.*/
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Comments\comments-1.rexx was migrated on 23 Mar 2025 at 10:43:08
 * -------------------------------------------------------------------------
*/ 
