/*ª*REXX program shows how to get an environmental variable under Windows*/

x=value('TEMP',,'SYSTEM')
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Environment-variables\environment-variables-1.rexx was migrated on 23 Mar 2025 at 10:43:12
 * -------------------------------------------------------------------------
*/ 
