do j=10  by -2  to 0
say j
j=j+1     /*ª*this increments the  DO  index.   Do NOT program like this! */
end
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Loops-Downward-for\loops-downward-for-3.rexx was migrated on 23 Mar 2025 at 10:43:19
 * -------------------------------------------------------------------------
*/ 
