say value('COMPUTERNAME',,"SYSTEM")
say value('OS',,"SYSTEM")
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Hostname\hostname-2.rexx was migrated on 23 Mar 2025 at 10:43:16
 * -------------------------------------------------------------------------
*/ 
