say value('COMPUTERNAME',,"ENVIRONMENT")
say value('OS',,"ENVIRONMENT")
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Hostname\hostname-1.rexx was migrated on 23 Mar 2025 at 10:43:16
 * -------------------------------------------------------------------------
*/ 
