/*ª*REXX program (using the R4 REXX interpreter) which uses a Greek delta char).*/
'chcp'  1253  "> NUL"                  /*ª*ensure we're using correct code page.*/
newV1=1                                    /*ª*define delta (variable name  Î”)  to 1*/
newV1=newV1+1                                  /*ª*bump the delta REXX variable by unity*/
say 'Î”=' newV1                             /*ª*stick a fork in it,  we're all done. */
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Unicode-variable-names\unicode-variable-names.rexx was migrated on 23 Mar 2025 at 10:43:34
 * -------------------------------------------------------------------------
*/ 
