/*ช*REXX program demonstrates a     DO  UNTIL     construction.           */
v=0
do  until  v//6==0           /*ช*REXX   //   is the รท remainder.*/
v=v+1
say v
end
/*ช*stick a fork in it, we're done.*/
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Loops-Do-while\loops-do-while-1.rexx was migrated on 23 Mar 2025 at 10:43:19
 * -------------------------------------------------------------------------
*/ 
