/*ช*REXX program demonstrates a     DO  UNTIL     construction.           */

do v=1  until  v//6==0       /*ช*REXX   //   is the รท remainder.*/
say v
end
/*ช*stick a fork in it, we're done.*/
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Loops-Do-while\loops-do-while-2.rexx was migrated on 23 Mar 2025 at 10:43:19
 * -------------------------------------------------------------------------
*/ 
