/*�*REXX program demonstrates if any key has been presssed.               */

∙
∙
∙
somechar=inkey('nowait')
∙
∙
∙
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Keyboard-input-Keypress-check\keyboard-input-keypress-check.rexx was migrated on 23 Mar 2025 at 10:43:18
 * -------------------------------------------------------------------------
*/ 
