a = -199e-12
b = 12.

parse value  a  b    with    b  a    /*ª*swap A and B */
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Generic-swap\generic-swap-3.rexx was migrated on 23 Mar 2025 at 10:43:15
 * -------------------------------------------------------------------------
*/ 
