j=2
abc.j= -4.12


say 'variable abc.2 (length' length(abc.2)')='  abc.2
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Reflection-List-properties\reflection-list-properties-1.rexx was migrated on 23 Mar 2025 at 10:43:26
 * -------------------------------------------------------------------------
*/ 
