s="He"
s=s || 'llo, World!'       /*ª*same as:   s=s||'llo, World!'    */
say s
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\String-append\string-append-2.rexx was migrated on 23 Mar 2025 at 10:43:31
 * -------------------------------------------------------------------------
*/ 
