s= 'abcd'
say "length(s) ="   length(s)            /*�* ──► 1000 */
say "'LENGTH'(s) ="   'LENGTH'(s)        /*�* ──►  4   */
exit

length: return 1000
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Naming-conventions\naming-conventions-2.rexx was migrated on 23 Mar 2025 at 10:43:22
 * -------------------------------------------------------------------------
*/ 
