radius=6.28                            /*ª*assign a value to a variable.  */
say 'radius =' radius
drop radius                            /*ª*now, "undefine" the variable.  */
say 'radius =' radius
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Variables\variables-7.rexx was migrated on 23 Mar 2025 at 10:43:34
 * -------------------------------------------------------------------------
*/ 
