/*ª* This is program 2 */
say 'This is program 2 writing on standard output.'
say 'We now return to the caller.'
return
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Include-a-file\include-a-file-4.rexx was migrated on 23 Mar 2025 at 10:43:17
 * -------------------------------------------------------------------------
*/ 
