print_all:  procedure              /*ª*   [â†“]     is the # of args passed.*/
do j=1  for arg()
say  arg(j)
end   /*ª*j*/
return
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Variadic-function\variadic-function-1.rexx was migrated on 23 Mar 2025 at 10:43:34
 * -------------------------------------------------------------------------
*/ 
