/*ª*REXX program demonstrates  displaying an extended character  (glyph)  to the terminal.*/
/*ª* [â†“]  this  SAY will display the Â£ glyph (if the term supports it).*/
say 'Â£'            /*ª*this assumes the pound sign glyph is displayable on the terminal.  */
/*ª*this program can execute correctly on an  EBCDIC or ASCII  machine.*/
/*ª*stick a fork in it,  we're all done. */
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Terminal-control-Display-an-extended-character\terminal-control-display-an-extended-character.rexx was migrated on 23 Mar 2025 at 10:43:32
 * -------------------------------------------------------------------------
*/ 
