/*ª*REXX program determines if input comes from terminal or standard input*/

if queued()  then say 'input comes from the terminal.'
else say 'input comes from the (stacked) terminal queue.'

/*ª*stick a fork in it, we're done.*/
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Check-input-device-is-a-terminal\check-input-device-is-a-terminal.rexx was migrated on 23 Mar 2025 at 10:43:08
 * -------------------------------------------------------------------------
*/ 
