/*ª*REXX program displays the  word      SPAM      forever.               */

do forever
say 'SPAM'
end   /*ª*DO forever*/
/*ª*control will never reach here. */
/*ª*don't stick a fork in it.      */
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Loops-Infinite\loops-infinite-1.rexx was migrated on 23 Mar 2025 at 10:43:20
 * -------------------------------------------------------------------------
*/ 
