/*ª*REXX program lists contents of current folder  (ala mode UNIX's  LS). */
'DIR  /b  /oN'                         /*ª*use Windows DIR: sorts & lists.*/
/*ª*stick a fork in it, we're done.*/
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Unix-ls\unix-ls.rexx was migrated on 23 Mar 2025 at 10:43:34
 * -------------------------------------------------------------------------
*/ 
