/*ª*REXX*/
address 'XEDIT'
.
.
.
[XEDIT commands here.]
.
.
.
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Start-from-a-main-routine\start-from-a-main-routine.rexx was migrated on 23 Mar 2025 at 10:43:30
 * -------------------------------------------------------------------------
*/ 
