call random ,,44    /*ª*the seed in this case is "44". */
.
.
.
y = random(100, 200)
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Random-number-generator-included-\random-number-generator-included--2.rexx was migrated on 23 Mar 2025 at 10:43:26
 * -------------------------------------------------------------------------
*/ 
