/*ª*REXX program prints a string to the  (DOS) line printer  via redirection to a printer.*/
newV1= 'Hello World!'                                /*ª*define a string to be used for output*/
'@ECHO'   newV1    ">PRN"                            /*ª*stick a fork in it,  we're all done. */
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Hello-world-Line-printer\hello-world-line-printer.rexx was migrated on 23 Mar 2025 at 10:43:16
 * -------------------------------------------------------------------------
*/ 
