/*ª*output from parse version (almost all REXX versions)  */
/*ª*      theREXXinterpreterName level mm Mon yyyy        */
parse version . level .
if level<4  then exit
/* -------------------------------------------------------------------------
 * REXX C:\Users\PeterJ\rexxetta\rexx\Introspection\introspection-1.rexx was migrated on 23 Mar 2025 at 10:43:17
 * -------------------------------------------------------------------------
*/ 
